apache/nuttx/arch/arm/src/imxrt/imxrt_edma_ver2.c
static int imxrt_edma_interrupt(int irq, void *context, void *arg)
{
  struct imxrt_dmach_s *dmach = (struct imxrt_dmach_s *)arg;

#ifdef IMXRT_DMA3_BASE
  if ((irq >= IMXRT_IRQ_DMA3_CH0) && (irq <= IMXRT_IRQ_DMA3_CH31))
    {
      /* eDMA3 interrupt has a single source */

      imxrt_edma_isr(irq, context, dmach);
    }
#endif

#ifdef IMXRT_DMA4_BASE
  if ((irq >= IMXRT_IRQ_DMA4_CH0_CH1_CH32_CH33) &&
      (irq <= IMXRT_IRQ_DMA4_CH30_CH31_CH62_CH63))
    {
      /* eDMA4 interrupt has four sources on iMXRT8x */

      imxrt_edma_isr(irq, context, dmach);
      imxrt_edma_isr(irq, context, dmach + 1);
      imxrt_edma_isr(irq, context, dmach + 32);
      imxrt_edma_isr(irq, context, dmach + 33);
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: imxrt_edma_configure
 *
 * Description:
 *   Configure eDMA instance.
 *
 ****************************************************************************/

static void imxrt_edma_configure(uintptr_t base)
{
  uint32_t regval;

  /* Configure the eDMA controllers */

  regval = getreg32(IMXRT_EDMA_CSR(base));
  regval &= ~(EDMA_CSR_EDBG | EDMA_CSR_ERCA | EDMA_CSR_HAE | EDMA_CSR_GCLC |
              EDMA_CSR_GMRC);

#ifdef CONFIG_IMXRT_EDMA_EDBG
  regval |= EDMA_CSR_EDBG;   /* Enable Debug */
#endif
#ifdef CONFIG_IMXRT_EDMA_ERCA
  regval |= EDMA_CSR_ERCA;   /* Enable Round Robin Channel Arbitration */
#endif
#ifdef CONFIG_IMXRT_EDMA_ERGA
  regval |= EDMA_CSR_ERGA;   /* Enable Round Robin Group Arbitration */
#endif
#ifdef CONFIG_IMXRT_EDMA_HOE
  regval |= EDMA_CSR_HAE;    /* Halt On Error */
#endif
#ifdef CONFIG_IMXRT_EDMA_CLM
  regval |= EDMA_CSR_GCLC;   /* Continuous Link Mode */
#endif

  putreg32(regval, IMXRT_EDMA_CSR(base));
}

/****************************************************************************
 * Name: imxrt_find_free_ch
 *
 * Description:
 *   Configure eDMA instance.
 *
 ****************************************************************************/

static struct imxrt_dmach_s * imxrt_find_free_ch(uint16_t dmamux)
{
  struct imxrt_dmach_s *candidate;
  uintptr_t base;
  unsigned int chndx;
  unsigned int offset;
  unsigned int max;

  /* eDMA base for MUX */

  base = imxrt_dmamux_get_dmabase(dmamux);

  /* On RT118x both eDMA3 and eDMA4 have per-channel CH_MUX registers so
   * any free channel of the correct engine can be used.
   */

  offset = imxrt_edma_choffset(base);
  max    = imxrt_edma_chmax(base);

  for (chndx = offset; chndx < max; chndx++)
    {
      candidate = &g_edma.dmach[chndx];
      if (!candidate->inuse)
        {
          return candidate;
        }
    }

  return NULL;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: arm_dma_initialize
 *
 * Description:
 *   Initialize the DMA subsystem
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void weak_function arm_dma_initialize(void)
{
  struct imxrt_dmach_s *dmach;
  uintptr_t base;
  int chan;
  int i;

  dmainfo("Initialize eDMA\n");

  /* Configure the instances. */

  dmach = &g_edma.dmach[0];

#ifdef IMXRT_DMA3_BASE
  /* Configure eDMA3's LPCG29 (m33_clk_root). That root is already configured
   * by the M33 boot ROM so we only need to enable the LPCG.
   */

  imxrt_ccm_gate_on(CCM_LPCG_EDMA3, true);

  imxrt_edma_configure(IMXRT_DMA3_BASE);

  /* Initialize the channel */

  for (i = 0; i < DMA3_CHANNEL_COUNT; i++, dmach++)
    {
      dmach->base = IMXRT_DMA3_BASE;
      dmach->chan = i;

      irq_attach(IMXRT_IRQ_DMA3_CH0 + i, imxrt_edma_interrupt, dmach);
    }
#endif

#ifdef IMXRT_DMA4_BASE
  /* Configure eDMA4's clock root and enable its LPCG.
   *
   * wakeup_axi_clk_root = SYS_PLL3_OUT (480 MHz) / 2 = 240 MHz.
   */

  imxrt_ccm_configure_root_clock(CCM_CR_WAKEUP_AXI, SYS_PLL3_OUT, 2);

  /* Enable peripheral clock (eDMA4: wakeup_axi_clk_root, LPCG30) */

  imxrt_ccm_gate_on(CCM_LPCG_EDMA4, true);

  imxrt_edma_configure(IMXRT_DMA4_BASE);

  /* Initialize the channel */

  for (i = 0; i < DMA4_CHANNEL_COUNT; i++, dmach++)
    {
      dmach->base = IMXRT_DMA4_BASE;
      dmach->chan = i;

      /* Each eDMA4 interrupt is shared by four channels: n, n+1, n+32 and
       * n+33.  So IRQ (DMA4_CH0_CH1_CH32_CH33 + k) serves the channels
       * 2k, 2k+1, 2k+32 and 2k+33, and the 64 channels are covered by the
       * 32 lowest channel handles only.  Attach every second channel of
       * the lower half and pass that channel's handle as the argument.
       */

      if (i < (DMA4_CHANNEL_COUNT / 2) && (i & 0x01) == 0)
        {
          irq_attach(IMXRT_IRQ_DMA4_CH0_CH1_CH32_CH33 + (i >> 1),
                     imxrt_edma_interrupt, dmach);
        }
    }
#endif

#if CONFIG_IMXRT_EDMA_NTCD > 0
  /* Initialize the list of free TCDs from the pool of pre-allocated TCDs. */

  imxrt_tcd_initialize();
#endif

  /* Disable all DMA channel interrupts at the eDMA controller */

  for (i = 0; i < IMXRT_EDMA_NCHANNELS; i++)
    {
      /* DMA engine base and TCD channel */

      base = g_edma.dmach[i].base;
      chan = g_edma.dmach[i].chan;

      /* Disable all DMA channels and DMA channel interrupts */

      putreg32(0, IMXRT_EDMA_TCD(base, chan) + IMXRT_EDMA_CH_CSR_OFFSET);

      /* Clear interrupt if any */

      putreg32(1, IMXRT_EDMA_TCD(base, chan) + IMXRT_EDMA_CH_INT_OFFSET);

      /* Set all TCD CSR, biter and citer entries to 0 so that
       * will be 0 when DONE is not set so that imxrt_dmach_getcount
       * reports 0.
       */

      putreg16(0, IMXRT_EDMA_TCD(base, chan) + IMXRT_EDMA_TCD_CSR_OFFSET);
      putreg16(0, IMXRT_EDMA_TCD(base, chan) + IMXRT_EDMA_TCD_CITER_OFFSET);
      putreg16(0, IMXRT_EDMA_TCD(base, chan) + IMXRT_EDMA_TCD_BITER_OFFSET);
    }

#ifdef IMXRT_DMA3_BASE
  /* Clear all pending DMA channel interrupts */

  putreg32(0xffffffff, IMXRT_EDMA_INT);

  /* Enable the channel interrupts at the NVIC (still disabled at the eDMA
   * controller).
   */

  for (i = 0; i < DMA3_IRQ_COUNT; i++)
    {
      up_enable_irq(IMXRT_IRQ_DMA3_CH0 + i);
    }
#endif

#ifdef IMXRT_DMA4_BASE
  /* Clear all pending DMA channel interrupts */

  putreg32(0xffffffff, IMXRT_EDMA_INT_LOW);
  putreg32(0xffffffff, IMXRT_EDMA_INT_HIGH);

  /* Enable the channel interrupts at the NVIC (still disabled at the eDMA
   * controller).
   */

  for (i = 0; i < DMA4_IRQ_COUNT; i++)
    {
      up_enable_irq(IMXRT_IRQ_DMA4_CH0_CH1_CH32_CH33 + i);
    }
#endif
}

/****************************************************************************
 * Name: imxrt_dmach_alloc
 *
 *   Allocate a DMA channel.  This function sets aside a DMA channel,
 *   initializes the DMAMUX for the channel, then gives the caller exclusive
 *   access to the DMA channel.
 *
 * Input Parameters:
 *
 *   dmamux - DMAMUX configuration see DMAMUX channel configuration register
 *            bit-field definitions in hardware/imxrt_dmamux.h.
 *            Settings include:
 *
 *            DMAMUX_CHCFG_SOURCE     Chip-specific DMA source (required)
 *            DMAMUX_CHCFG_TRIG       DMA Channel Trigger Enable (optional)
 *            DMAMUX_CHCFG_ENBL       DMA Mux Channel Enable (required)
 *
 *            A value of zero will disable the DMAMUX channel.
 *   dchpri - DCHPRI channel priority configuration.  See DCHPRI channel
 *            configuration register bit-field definitions in
 *            hardware/imxrt_edma.h.  Meaningful settings include:
 *
 *            EDMA_DCHPRI_CHPRI       Channel Arbitration Priority
 *            DCHPRI_DPA              Disable Preempt Ability
 *            DCHPRI_ECP              Enable Channel Preemption
 *
 *            The power-on default, 0x05, is a reasonable choice.
 *
 * Returned Value:
 *   If a DMA channel is available, this function returns a non-NULL, void*
 *   DMA channel handle.  NULL is returned on any failure.
 *
 ****************************************************************************/

