apache/nuttx/arch/arm/src/imxrt/imxrt_edma_ver2.c
DMACH_HANDLE imxrt_dmach_alloc(uint16_t dmamux, uint8_t dchpri)
{
  struct imxrt_dmach_s *dmach;
  uintptr_t base;
  uint32_t regval;
  int ret;

  /* Search for an available DMA channel */

  dmach = NULL;
  ret = nxmutex_lock(&g_edma.chlock);
  if (ret < 0)
    {
      return NULL;
    }

  /* Find channel for this DMA MUX */

  dmach = imxrt_find_free_ch(dmamux);
  if (dmach)
    {
      dmach->inuse  = true;
      dmach->state  = IMXRT_DMA_IDLE;
      dmach->dmamux = dmamux & EDMA_MUX_MASK;

      /* TCD register base */

      base = IMXRT_EDMA_TCD(dmach->base, dmach->chan);

      /* Clear any pending interrupts on the channel */

      putreg32(0, base + IMXRT_EDMA_CH_CSR_OFFSET);

      /* Make sure that the channel is disabled. */

      putreg32(EDMA_CH_INT, base + IMXRT_EDMA_CH_INT_OFFSET);

      regval = getreg32(base + IMXRT_EDMA_CH_SBR_OFFSET);
      regval |= EDMA_CH_SBR_EMI | EDMA_CH_SBR_SEC | EDMA_CH_SBR_PAL;
      putreg32(regval, base + IMXRT_EDMA_CH_SBR_OFFSET);

      /* Set the DMAMUX source */

      if (imxrt_edma_tcdhasmux(dmach->base))
        {
          /* Set reset value first to CH MUX */

          putreg8(0, base + IMXRT_EDMA_CH_MUX_OFFSET);
          dmainfo("CH%d: MUX:%u->%p\n", dmach->chan, dmach->dmamux,
                  (void *)(base + IMXRT_EDMA_CH_MUX_OFFSET));
          putreg8(dmach->dmamux, base + IMXRT_EDMA_CH_MUX_OFFSET);
        }
    }

  nxmutex_unlock(&g_edma.chlock);

  /* Show the result of the allocation */

  if (dmach != NULL)
    {
      dmainfo("CH%d: returning dmach: %p\n", dmach->chan, dmach);
    }
  else
    {
      dmaerr("ERROR: Failed allocate eDMA channel\n");
    }

  return (DMACH_HANDLE)dmach;
}

/****************************************************************************
 * Name: imxrt_dmach_free
 *
 * Description:
 *   Release a DMA channel.  NOTE:  The 'handle' used in this argument must
 *   NEVER be used again until imxrt_dmach_alloc() is called again to
 *   re-gain a valid handle.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void imxrt_dmach_free(DMACH_HANDLE handle)
{
  struct imxrt_dmach_s *dmach = (struct imxrt_dmach_s *)handle;
  uintptr_t base = IMXRT_EDMA_TCD(dmach->base, dmach->chan);

  dmainfo("dmach: %p\n", dmach);
  DEBUGASSERT(dmach != NULL && dmach->inuse &&
              dmach->state != IMXRT_DMA_ACTIVE);

  /* Mark the channel no longer in use.  Clearing the inuse flag is an atomic
   * operation and so should be safe.
   */

  dmach->flags = 0;
  dmach->inuse = false;                /* No longer in use */
  dmach->state = IMXRT_DMA_IDLE;       /* Better not be active! */

  /* Make sure that the channel is disabled. */

  putreg32(EDMA_CH_INT, base + IMXRT_EDMA_CH_INT_OFFSET);

  /* Disable the associated DMAMUX */

  if (imxrt_edma_tcdhasmux(dmach->base))
    {
      putreg8(0, base + IMXRT_EDMA_CH_MUX_OFFSET);
    }
}

/****************************************************************************
 * Name: imxrt_dmach_xfrsetup
 *
 * Description:
 *   This function adds the eDMA transfer to the DMA sequence.  The request
 *   is setup according to the content of the transfer configuration
 *   structure. For "normal" DMA, imxrt_dmach_xfrsetup is called only once.
 *   Scatter/gather DMA is accomplished by calling this function repeatedly,
 *   once for each transfer in the sequence.  Scatter/gather DMA processing
 *   is enabled automatically when the second transfer configuration is
 *   received.
 *
 *   This function may be called multiple times to handle multiple,
 *   discontinuous transfers (scatter-gather)
 *
 * Input Parameters:
 *   handle - DMA channel handle created by imxrt_dmach_alloc()
 *   config - A DMA transfer configuration instance, populated by the
 *            The content of 'config' describes the transfer
 *
 * Returned Value
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

int imxrt_dmach_xfrsetup(DMACH_HANDLE handle,
                        const struct imxrt_edma_xfrconfig_s *config)
{
  struct imxrt_dmach_s *dmach = (struct imxrt_dmach_s *)handle;
  uintptr_t base = IMXRT_EDMA_TCD(dmach->base, dmach->chan);
#if CONFIG_IMXRT_EDMA_NTCD > 0
  struct imxrt_edmatcd_s *tcd;
  struct imxrt_edmatcd_s *prev;
  uint16_t mask = config->flags & EDMA_CONFIG_INTMAJOR ? 0 :
                                  EDMA_TCD_CSR_INTMAJOR;
  uint16_t regval16;
#else
  uint32_t regval32;
#endif

  DEBUGASSERT(dmach != NULL);
  dmainfo("dmach%u: %p config: %p\n", dmach->chan, dmach, config);

  dmach->flags  = config->flags;

#if CONFIG_IMXRT_EDMA_NTCD > 0
  /* Scatter/gather DMA is supported */

  /* Allocate a TCD, waiting if necessary */

  tcd = imxrt_tcd_alloc();

  /* Configure current TCD block transfer. */

  imxrt_tcd_configure(tcd, config);

  /* Enable the interrupt when the major iteration count completes for this
   * TCD.  For "normal" DMAs, this will correspond to the DMA DONE
   * interrupt; for scatter gather DMAs, multiple interrupts will be
   * generated with the final being the DONE interrupt.
   */

  tcd->csr |= EDMA_TCD_CSR_INTMAJOR;

  /* Is this the first descriptor in the list? */

  if (dmach->head == NULL)
    {
      /* Yes.. add it to the list */

      dmach->head  = tcd;
      dmach->tail  = tcd;

      /* And instantiate the first TCD in the DMA channel TCD registers. */

      imxrt_tcd_instantiate(dmach, tcd);
    }
  else
    {
      /* Cannot mix transfer types */

      if (dmach->flags & EDMA_CONFIG_LOOP_MASK)
        {
          imxrt_tcd_free(tcd);
          return -EINVAL;
        }

      /* Chain from previous descriptor in the list. */

      /* Enable scatter/gather feature in the previous TCD. */

      prev           = dmach->tail;
      regval16       = prev->csr;
      regval16      &= ~(EDMA_TCD_CSR_DREQ | mask);
      regval16      |= EDMA_TCD_CSR_ESG;
      prev->csr      = regval16;

      prev->dlastsga = (uint32_t)((uintptr_t)tcd);
      dmach->tail    = tcd;

      /* Clean cache associated with the previous TCD memory */

      up_clean_dcache((uintptr_t)prev,
                      (uintptr_t)prev + sizeof(struct imxrt_edmatcd_s));

